tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26j53_tdd.h
#define ACKSTAT1                      1649
#define GCEN1                         1650
#define SSP1CON2_GCEN                 1651
#define SSP1CON1                      1652
#define SSP1CON1_SSPM0                1653
#define SSPM01                        1654
#define SSP1CON1_SSPM                 1655
#define SSP1CON1_SSPM1                1656
#define SSPM11                        1657
#define SSP1CON1_SSPM2                1658
#define SSPM21                        1659
#define SSPM31                        1660
#define SSP1CON1_SSPM3                1661
#define SSP1CON1_CKP                  1662
#define CKP1                          1663
#define SSPEN1                        1664
#define SSP1CON1_SSPEN                1665
#define SSPOV1                        1666
#define SSP1CON1_SSPOV                1667
#define WCOL1                         1668
#define SSP1CON1_WCOL                 1669
#define SSP1STAT                      1670
#define BF1                           1671
#define SSP1STAT_BF                   1672
#define SSP1STAT_UA                   1673
#define UA1                           1674
#define SSP1STAT_R_NOT_W              1675
#define READ_WRITE                    1676
#define RW1                           1677
#define NOT_W                         1678
#define I2C_READ                      1679
#define nW                            1680
#define RW                            1681
#define nWRITE                        1682
#define R                             1683
#define NOT_WRITE                     1684
#define R_W                           1685
#define SSP1STAT_R_nW                 1686
#define SSP1STAT_S                    1687
#define START                         1688
#define START1                        1689
#define I2C_START                     1690
#define STOP                          1691
#define SSP1STAT_P                    1692
#define STOP1                         1693
#define I2C_STOP                      1694
#define SSP1STAT_D_NOT_A              1695
#define NOT_A                         1696
#define SSP1STAT_D_nA                 1697
#define nA                            1698
#define D_A                           1699
#define D                             1700
#define DA1                           1701
#define DA                            1702
#define DATA_ADDRESS                  1703
#define NOT_ADDRESS                   1704
#define nADDRESS                      1705
#define I2C_DAT                       1706
#define SSP1STAT_CKE                  1707
#define CKE1                          1708
#define SSP1STAT_SMP                  1709
#define SMP1                          1710
#define SSP1ADD                       1711
#define SSP1ADD_SSPADD                1712
#define SSP1ADD_MSK0                  1713
#define MSK01                         1714
#define SSP1ADD_MSK1                  1715
#define MSK11                         1716
#define SSP1ADD_MSK2                  1717
#define MSK21                         1718
#define MSK31                         1719
#define SSP1ADD_MSK3                  1720
#define SSP1ADD_MSK4                  1721
#define MSK41                         1722
#define MSK51                         1723
#define SSP1ADD_MSK5                  1724
#define SSP1ADD_MSK6                  1725
#define MSK61                         1726
#define MSK71                         1727
#define SSP1ADD_MSK7                  1728
#define SSP1MSK                       1729
#define SSP1MSK_MSK0                  1730
#define SSP1MSK_MSK1                  1731
#define SSP1MSK_MSK2                  1732
#define SSP1MSK_MSK3                  1733
#define SSP1MSK_MSK4                  1734
#define SSP1MSK_MSK5                  1735
#define SSP1MSK_MSK6                  1736
#define SSP1MSK_MSK7                  1737
#define SSP1BUF                       1738
#define SSP1BUF_SSPBUF                1739
#define T2CON                         1740
#define T2CKPS0                       1741
#define T2CKPS                        1742
#define T2CKPS1                       1743
#define TMR2ON                        1744
#define T2OUTPS0                      1745
#define T2OUTPS                       1746
#define T2OUTPS1                      1747
#define T2OUTPS2                      1748
#define T2OUTPS3                      1749
#define WM0                           1750
#define PR2                           1751
#define WM1                           1752
#define WAIT0                         1753
#define WAIT1                         1754
#define EBDIS                         1755
#define TMR2                          1756
#define T1CON                         1757
#define TMR1ON                        1758
#define T1CON_RD16                    1759
#define NOT_T1SYNC                    1760
#define nT1SYNC                       1761
#define T1OSCEN                       1762
#define SOSCEN                        1763
#define T1CKPS0                       1764
#define T1CKPS                        1765
#define T1CKPS1                       1766
#define TMR1CS0                       1767
#define TMR1CS                        1768
#define T1RD16                        1769
#define TMR1CS1                       1770
#define TMR1L                         1771
#define TMR1H                         1772
#define RCON                          1773
#define BOR                           1774
#define NOT_BOR                       1775
#define nBOR                          1776
#define POR                           1777
#define nPOR                          1778
#define NOT_POR                       1779
#define PD                            1780
#define nPD                           1781
#define NOT_PD                        1782
#define nTO                           1783
#define TO                            1784
#define NOT_TO                        1785
#define nRI                           1786
#define NOT_RI                        1787
#define RI                            1788
#define NOT_CM                        1789
#define CM                            1790
#define nCM                           1791
#define IPEN                          1792
#define CM2CON                        1793
#define CM2CON_CCH                    1794
#define CM2CON_CCH0                   1795
#define CCH02                         1796
#define CCH12                         1797
#define CM2CON_CCH1                   1798
#define CM2CON_CREF                   1799
#define CREF2                         1800
#define CM2CON_EVPOL                  1801
#define EVPOL02                       1802
#define CM2CON_EVPOL0                 1803
#define EVPOL12                       1804
#define CM2CON_EVPOL1                 1805
#define CM2CON_CPOL                   1806
#define CPOL2                         1807
#define CM2CON_COE                    1808
#define COE2                          1809
#define CM2CON_CON                    1810
#define CON2                          1811
#define CM1CON                        1812
#define CM1CON_CCH                    1813
#define C1CH0                         1814
#define CM1CON_CCH0                   1815
#define CCH01                         1816
#define CCH11                         1817
#define C1CH1                         1818
#define CM1CON_CCH1                   1819
#define CM1CON_CREF                   1820
#define CREF1                         1821
#define EVPOL01                       1822
#define CM1CON_EVPOL0                 1823
#define CM1CON_EVPOL                  1824
#define CM1CON_EVPOL1                 1825
#define EVPOL11                       1826
#define CM1CON_CPOL                   1827
#define CPOL1                         1828
#define CM1CON_COE                    1829
#define COE1                          1830
#define CM1CON_CON                    1831
#define CON1                          1832
#define OSCCON                        1833
#define SCS0                          1834
#define SCS                           1835
#define SCS1                          1836
#define FLTS                          1837
#define OSTS                          1838
#define IRCF                          1839
#define IRCF0                         1840
#define IRCF1                         1841
#define IRCF2                         1842
#define IDLEN                         1843
#define T0CON                         1844
#define T0PS                          1845
#define T0PS0                         1846
#define T0PS1                         1847
#define T0PS2                         1848
#define PSA                           1849
#define T0SE                          1850
#define T0CS                          1851
#define T08BIT                        1852
#define TMR0ON                        1853
#define TMR0L                         1854
#define TMR0H                         1855
#define STATUS                        1856
#define C                             1857
#define CARRY                         1858
#define DC                            1859
#define ZERO                          1860
#define Z                             1861
#define OV                            1862
#define OVERFLOW                      1863
#define N                             1864
#define NEGATIVE                      1865
#define FSR2L                         1866
#define PLUSW2                        1867
#define PREINC2                       1868
#define POSTDEC2                      1869
#define POSTINC2                      1870
#define INDF2                         1871
#define FSR1L                         1872
#define PLUSW1                        1873
#define PREINC1                       1874
#define POSTDEC1                      1875
#define POSTINC1                      1876
#define INDF1                         1877
#define WREG                          1878
#define FSR0L                         1879
#define PLUSW0                        1880
#define PREINC0                       1881
#define POSTDEC0                      1882
#define POSTINC0                      1883
#define INDF0                         1884
#define INTCON3                       1885
#define INT1IF                        1886
#define INT1F                         1887
#define INT2IF                        1888
#define INT2F                         1889
#define INT3F                         1890
#define INT3IF                        1891
#define INT1E                         1892
#define INT1IE                        1893
#define INT2IE                        1894
#define INT2E                         1895
#define INT3E                         1896
#define INT3IE                        1897
#define INT1P                         1898
#define INT1IP                        1899
#define INT2IP                        1900
#define INT2P                         1901
#define INTCON2                       1902
#define RBIP                          1903
#define INT3IP                        1904
#define INT3P                         1905
#define TMR0IP                        1906
#define T0IP                          1907
#define INTEDG3                       1908
#define INTEDG2                       1909
#define INTEDG1                       1910
#define INTEDG0                       1911
#define RBPU                          1912
#define NOT_RBPU                      1913
#define nRBPU                         1914
#define INTCON                        1915
#define RBIF                          1916
#define INT0F                         1917
#define INT0IF                        1918
#define T0IF                          1919
#define TMR0IF                        1920
#define RBIE                          1921
#define INT0E                         1922
#define INT0IE                        1923
#define T0IE                          1924
#define TMR0IE                        1925
#define PEIE                          1926
#define PEIE_GIEL                     1927
#define GIEL                          1928
#define GIE_GIEH                      1929
#define GIE                           1930
#define GIEH                          1931
#define PRODL                         1932
#define PRODH                         1933
#define TABLAT                        1934
#define TBLPTRL                       1935
#define TBLPTRH                       1936
#define PCL                           1937
#define PCLATH                        1938
#define PCH                           1939
#define SP0                           1940
#define STKPTR                        1941
#define SP1                           1942
#define SP2                           1943
#define SP3                           1944
#define SP4                           1945
#define STKUNF                        1946
#define STKOVF                        1947
#define STKFUL                        1948
#define TOSL                          1949
#define TOSH                          1950

#endif // _PIC18LF26J53_H_
